/*Написать программу, которая переводит значение угла из граду-
сов в радианы, и, наоборот, в зависимости от символа при вводе.
Например:
45.00D - означает значение в градусах, а 45.00R - в радианах. Ввод данных осуществляется по шаблону
%f%c*/
/*
#include <stdio.h>
#define PI 3.14159265

int main()
{
    float degrees;
    float radians;

    printf("Enter an angle in degrees:\n");
    scanf("%fc", &degrees);

    radians = degrees * (PI / 180.0);
    printf("%fc degrees = %fc radians\n", degrees, radians);
getchar();
    while(true){}
	return 0;
} */